base/InformationRegisters/бит_мдм_ПравилаПодготовкиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_мдм_ПравилаПодготовкиОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мдм_ПравилаОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мдм_ОписанияОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИнформационнойБазыПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_ВидыИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБазаПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиВнешнихПодключений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мдм_ОписанияОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/бит_НазначенныеЗаместители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НазначенныеЗаместители</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПередаватьПраваРЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СостоянияЗаместителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Виза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыВиз</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_Визы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПользовательскоеУсловие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАдресации_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАдресации_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАдресации_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заместитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/бит_ЗаместителиПоЗадачам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗаместителиПоЗадачам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СостоянияЗаместителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заместитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/бит_НастройкиАвтоСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиАвтоСогласования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыРешенийСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Просрочка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Виза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Визы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПользовательскоеУсловие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_СостоянияЗаместителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_СостоянияЗаместителей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Назначен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамещениеЗавершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_УстановкаКонтрольныхЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_УстановкаКонтрольныхЗначений</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_КонтрольныеЗначенияБюджетов</xr:Item>
				<xr:Item>InformationRegister.бит_СрокиКонтроляПоБюджету</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийКонтролируемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтклонения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОтклоненийКонтрольныхЗначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтклоненияКоличество</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОтклоненийКонтрольныхЗначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеОтклоненияКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_ЦФО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_БанковскийСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_6</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_7</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_8</Name>
					<Comment>Заполнять разрез бюджетирования "Аналитика_8"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_9</Name>
					<Comment>Заполнять разрез бюджетирования "Аналитика_9"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_10</Name>
					<Comment>Заполнять разрез бюджетирования "Аналитика_10"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_11</Name>
					<Comment>Заполнять разрез бюджетирования "Аналитика_11"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЗ_Аналитика_12</Name>
					<Comment>Заполнять разрез бюджетирования "Аналитика_12"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаКонтроля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияКонтроля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПериодичностьПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольнаяПериодичностьКонтроля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыКонтроляПоБюджету</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Catalogs/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/CommonModules/бит_РегламентныеЗадания/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_ВизированиеЧерезПочту.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_ВыгрузкаФайловPowerBI.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_ЗакрытиеДокументовПланирования.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_мдм_ВыполнениеОбмена.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_мдм_ПодготовкаОбмена.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_ОбработкаНазначенияЗаместителей.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_ОбработкаСобытийОповещений.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_ОповещенияТелеграм.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_ОтложеннаяТрансляция.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_ОчисткаОчередиТрансляции.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_сл_МенеджерСеансов.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_СозданиеДокументаПланирования.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_СоздатьДокументыПланированияИзДопУсловий.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_СтартПериодическихПроцессовБФ.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_УдалениеИсторииТелеграм.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_УдалениеОбработанныхЗаписейРегистрацииОповещений.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_УдалениеОповещений.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.бит_УстановкаКонтрольныхЗначений.ИмяМетода);
	
	бит_РегламентныеЗаданияПереопределяемый.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов
//
Процедура ПриПолученииСпискаШаблонов(ШаблоныЗаданий) Экспорт
	
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_АвтоСогласование.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_ВизированиеЧерезПочту.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_ВыгрузкаФайловPowerBI.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_ЗакрытиеДокументовПланирования.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_мдм_ВыполнениеОбмена.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_мдм_ПодготовкаОбмена.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_ОбработкаНазначенияЗаместителей.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_ОбработкаСобытийОповещений.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_ОповещенияТелеграм.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_ОтложеннаяТрансляция.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_ОчисткаОчередиТрансляции.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_сл_МенеджерСеансов.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_СозданиеДокументаПланирования.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_СоздатьДокументыПланированияИзДопУсловий.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_СтартПериодическихПроцессовБФ.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_УдалениеИсторииТелеграм.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_УдалениеОбработанныхЗаписейРегистрацииОповещений.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_УдалениеОповещений.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_УстановкаКонтрольныхЗначений.Имя);
	ШаблоныЗаданий.Добавить(Метаданные.РегламентныеЗадания.бит_УстановкаРешенийПоПросроченнымВизам.Имя);

	бит_РегламентныеЗаданияПереопределяемый.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	
КонецПроцедуры

#Область КазначействоУчетДоговоров
	
// Обработчик регламентного задания "бит_СозданиеДокументаПланирования". Создает документы планирования.
// 
// Параметры:
//  Нет.
// 
Процедура СозданиеДокументовПланирования() Экспорт
	
	бит_Казначейство.СозданиеДокументовПланирования();
	
КонецПроцедуры

// Обработчик регламентного задания "бит_ЗакрытиеДокументовПланирования". Закрывает документы планирования.
// 
// Параметры:
//  ПараметрыЗадания - Структура:
//		* НастройкаПодбораЗакрываемыхДокументов - СправочникСсылка.бит_СохраненныеНастройки.
// 
Процедура ЗакрытиеДокументовПланирования(ПараметрыЗадания) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_ЗакрытиеДокументовПланирования);
	
	НастройкаПодбораЗакрываемыхДокументов = Неопределено;
	Если ТипЗнч(ПараметрыЗадания) = Тип("Структура") Тогда
		ПараметрыЗадания.Свойство("НастройкаПодбораЗакрываемыхДокументов", НастройкаПодбораЗакрываемыхДокументов);
	КонецЕсли;
	
	ИмяСобытия = НСтр("ru='Начало закрытия документов планирования.';
					  |en='Start closing planning documents.'", ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = НСтр("ru='Начало закрытия документов планирования.';
						  |en='Start closing planning documents.'"); 
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
    								
	Обработки.бит_ЗакрытиеДокументовПланирования.ВыполнитьРегламентнуюОперацию(НастройкаПодбораЗакрываемыхДокументов);
		
	ИмяСобытия = НСтр("ru='Закрытие документов планирования завершено.';
					  |en='Closing planning documents completed.'", ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = НСтр("ru='Закрытие документов планирования завершено.';
						  |en='Closing planning documents completed.'"); 
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
    
КонецПроцедуры

#КонецОбласти

#Область Оповещения

// Обработчик регламентного задания "бит_ОтправкаОповещений". Выполняет отправку оповещений.
// 
// Параметры:
//	Нет.
//
Процедура ОтправкаОповещений() Экспорт
	 
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_ОтправкаОповещений);
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьМеханизмОповещений") Тогда
		ТекстИсключения = НСтр("ru='Регламентное задание недоступно по функциональным опциям.';
							   |en='Scheduled task is not available for functional options.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ИмяСобытия = НСтр("ru='Начало отправки оповещений.';
					  |en='Start sending notifications.'", ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = НСтр("ru='Начало отправки оповещений.';
						  |en='Start sending notifications.'"); 
    ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);	 
	 
	Обработки.бит_ОбработкаЗаписейРегистраОповещений.ОтправитьОповещения();
	
	ИмяСобытия = НСтр("ru='Отправка оповещений завершена.';
					  |en='Sending notifications completed.'", ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = НСтр("ru='Отправка оповещений завершена.';
						  |en='Sending notifications completed.'"); 
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);	 
	 
 КонецПроцедуры

// Обработчик регламентного задания "бит_УдалениеОповещений". Выполняет удаление отправленных оповещений.
// 
// Параметры:
//	Нет.
//
Процедура УдалениеОповещений() Экспорт
	 
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_УдалениеОповещений);
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьМеханизмОповещений") Тогда
		ТекстИсключения = НСтр("ru='Регламентное задание недоступно по функциональным опциям.';
							   |en='Scheduled task is not available for functional options.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ИмяСобытия = НСтр("ru='Начало удаления отправленных оповещений.';
					  |en='Start of deleting sent notifications.'", ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = НСтр("ru='Начало удаления отправленных оповещений.';
						  |en='Start of deleting sent notifications.'"); 
    ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
	 	 
	Обработки.бит_ОбработкаЗаписейРегистраОповещений.УдалитьОповещения();
	
	ИмяСобытия = НСтр("ru='Удаление отправленных оповещений завершено.';
					  |en='Deleting sent notifications completed.'", ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = НСтр("ru='Удаление отправленных оповещений завершено.';
						  |en='Deleting sent notifications completed.'"); 
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);	 
	 
КонецПроцедуры

// Обработчик регламентного задания "бит_ОбработкаСобытийОповещений". Формирует оповещения по зарегистрированным
//	событиям.
// 
// Параметры:
//	Нет.
//
Процедура ОбработкаСобытийОповещений() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_ОбработкаСобытийОповещений);
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьМеханизмОповещений") Тогда
		ТекстИсключения = НСтр("ru='Регламентное задание недоступно по функциональным опциям.';
							   |en='Scheduled task is not available for functional options.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;

	ИмяСобытия = НСтр("ru='Начало обработки зарегистрированных событий оповещений.';
					  |en='Start of processing the registered events of notifications.'", ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = НСтр("ru='Начало обработки зарегистрированных событий оповещений.';
						  |en='Start of processing the registered events of notifications.'"); 
    ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);	 
	
	ПараметрыОбработки = Обработки.бит_фн_ОбработкаЗаписейРегистрацииОповещений.НовыеПараметрыОбработкиСобытийОповещений();
	Обработки.бит_фн_ОбработкаЗаписейРегистрацииОповещений.ОбработатьСобытияОповещений(ПараметрыОбработки);
	
	ИмяСобытия = НСтр("ru='Обработка зарегистрированных событий оповещений завершена.';
					  |en='Processing registered notification events completed.'", ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = НСтр("ru='Обработка зарегистрированных событий оповещений завершена.';
							|en='Processing registered notification events completed.'"); 
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);

КонецПроцедуры

// Обработчик регламентного задания "бит_УдалениеОбработанныхЗаписейРегистрацииОповещений". Удаляет обработанные записи
//	регистра бит_фн_РегистрацияСобытийОповещений.
// 
// Параметры:
//	Нет.
// 
Процедура УдалениеОбработанныхЗаписейРегистрацииОповещений() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_УдалениеОбработанныхЗаписейРегистрацииОповещений);
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьМеханизмОповещений") Тогда
		ТекстИсключения = НСтр("ru='Регламентное задание недоступно по функциональным опциям.';
							   |en='Scheduled task is not available for functional options.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;

	ИмяСобытия = НСтр("ru='Начало удаления обработанных записей регистрации оповещений.';
					  |en='Start of removing the processed records of notifications registration.'",
					  ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = НСтр("ru='Начало удаления обработанных записей регистрации оповещений.';
						  |en='Start of removing the processed records of notifications registration.'"); 
    ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
	 	 
	Обработки.бит_фн_ОбработкаЗаписейРегистрацииОповещений.УдалитьОбработанныеЗаписи();
	
	ИмяСобытия = НСтр("ru='Завершено удаление обработанных записей регистрации оповещений.';
					  |en='Removing processed records of notifications registration completed.'",
					  ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = НСтр("ru='Завершено удаление обработанных записей регистрации оповещений.';
							|en='Removing processed records of notifications registration completed.'"); 
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);

КонецПроцедуры

#КонецОбласти

#Область МеханизмТрансляции

// Обработчик регламентного задания "бит_ОтложеннаяТрансляция". Выполняет отложенную трансляцию движений.
// 
// Параметры:
//	Нет.
//
Процедура ОтложеннаяТрансляция() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_ОтложеннаяТрансляция);

	Результат = Обработки.бит_ОбработкаЗаписейРегистраОчередьТрансляции.НачатьОтложеннуюТрансляцию();
	
	Если ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		РезультатыПакета = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Для каждого РезультатПакета Из РезультатыПакета Цикл
			Если РезультатПакета.Значение.Статус = "Ошибка" Тогда
				ВызватьИсключение РезультатПакета.Значение.ПодробноеПредставлениеОшибки;	
			КонецЕсли;                     	
		КонецЦикла;
	КонецЕсли;	  
	
КонецПроцедуры

// Обработчик регламентного задания "бит_ОчисткаОчередиТрансляции". Удаляет из очереди трансляции обработанные записи.
// 
// Параметры:
//	Нет.
//
Процедура ОчисткаОчередиТрансляции()  Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_ОчисткаОчередиТрансляции);
	
	Результат = Обработки.бит_ОбработкаЗаписейРегистраОчередьТрансляции.НачатьОтложеннуюОчисткуОчереди();
	
	Если ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		РезультатыПакета = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Для каждого РезультатПакета Из РезультатыПакета Цикл
			Если РезультатПакета.Значение.Статус = "Ошибка" Тогда
				ВызватьИсключение РезультатПакета.Значение.ПодробноеПредставлениеОшибки;	
			КонецЕсли;                     	
		КонецЦикла;
	КонецЕсли;	  

КонецПроцедуры

#КонецОбласти

#Область МДМ

// Обработчик регламентного задания "бит_мдм_ПодготовкаОбмена". Готовит объекты обмена для выполнения обмена.
// 
// Параметры:
//	Нет.
//
Процедура ПодготовкаОбменаМДМ() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_мдм_ПодготовкаОбмена);
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьПодключениеКВнешнимБазам")
		ИЛИ НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьМДМ") Тогда
		ТекстИсключения = НСтр("ru='Регламентное задание недоступно по функциональным опциям.';
							   |en='Scheduled task is not available for functional options.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	бит_мдм.ВыполнитьПодготовкуОбмена();
	
КонецПроцедуры

// Обработчик регламентного задания "бит_мдм_ВыполнениеОбмена". Отправляет обекты обмена во внешние базы.
// 
// Параметры:
//	Нет.
//
Процедура ВыполнениеОбменаМДМ() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_мдм_ВыполнениеОбмена);
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьПодключениеКВнешнимБазам") 
		ИЛИ НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьМДМ") Тогда
		ТекстИсключения = НСтр("ru='Регламентное задание недоступно по функциональным опциям.';
							   |en='Scheduled task is not available for functional options.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	бит_мдм_Транспорт.ОтправитьИзмененные();
	
КонецПроцедуры

// Процедура выполняет в фоне полный цикл обмена: регистрация изменений 
// - подготовку к обмену - отправку данных во внешние базы.
// 
// Параметры:
//  Источник - СправочникСсылка.
//  Настройки - Структура.
// 
Процедура ФоновыйОбменМДМ(Источник, Настройки) Экспорт
	
	МассивОтправки = Новый Массив;
	
	// Регистрация изменений.
	КэшОбработанных = Новый Соответствие;
	КэшОбработки    = Новый Соответствие;	
	СсылкаХранения  = бит_мдм.ВыполнитьРегистрациюИзмененийЭлементаСправочника(Источник, Настройки, КэшОбработанных, КэшОбработки, Истина);
	
	// Подготовка объектов для обмена.
	Если ЗначениеЗаполнено(СсылкаХранения) Тогда
		
		РезДанные = РегистрыСведений.бит_мдм_ПравилаПодготовкиОбмена.ПолучитьПравила();
		Правила = РезДанные.Правила;
		
		МассивПравил = Правила[СсылкаХранения.ОписаниеОбъекта];
		
		Если НЕ МассивПравил = Неопределено Тогда
			
			Для каждого ТекПравило Из МассивПравил Цикл
				
				КэшОбработанных = Новый Соответствие;
				КэшОбработки    = Новый Соответствие;	
				
				СсылкаОтправки = бит_мдм.ВыполнитьПодготовкуОбменаЭлементаСправочника(СсылкаХранения, ТекПравило, Правила, КэшОбработанных, КэшОбработки);
				
				Если ЗначениеЗаполнено(СсылкаОтправки) Тогда
				
					МассивОтправки.Добавить(СсылкаОтправки);
				
				КонецЕсли; 
				
			КонецЦикла; // По правилам.
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// Выполнение обмена.
	Для каждого СсылкаОтправки Из МассивОтправки Цикл
	
		бит_мдм_Транспорт.ОтправитьОбъект(СсылкаОтправки);
	
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеЗадания

// Обработчик регламентного задания "бит_РегистрацияНапоминанийПоДоговорам".
// Записывает в регистр "Регистрация оповещений" договора с истекающим сроком.
// 
// Параметры:
//  Нет.
//
Процедура РегистрацияНапоминанийПоДоговорам() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_РегистрацияНапоминанийПоДоговорам);
	бит_ОповещенияСервер.РегистрацияНапоминанийПоДоговорам();
		
КонецПроцедуры

// Обработчик регламентного задания "бит_РегистрацияНапоминанийОбОплате".
// Записывает в регистр "Регистрация оповещений" документы с приближающимся сроком оплаты.
// 
// Параметры:
//  Нет.
//
Процедура РегистрацияНапоминанийОбОплате() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_РегистрацияНапоминанийОбОплате);
	бит_ОповещенияСервер.РегистрацияНапоминанийОбОплате();
		
КонецПроцедуры

// Обработчик регламентного задания "бит_РегистрацияОповещенийОВизировании".
// Записывает в регистр "Регистрация оповещений" документы подлежащие визированию.
// 
// Параметры:
//  СтруктураПараметров - Структура.
// 
Процедура РегистрацияОповещенийОВизировании(СтруктураПараметров) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_РегистрацияОповещенийОВизировании);
	
	// Проверим корректность переданых параметров.
	Если НЕ ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураПараметров, "Оповещение", Неопределено);
	СогласующиеЛица = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураПараметров, "СогласующиеЛица", Неопределено);
	Если Оповещение = Неопределено
		ИЛИ СогласующиеЛица = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОбработкиВизирования = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураПараметров,
		"НастройкаОбработкиВизирования", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВсеПользователи", Справочники.ГруппыПользователей.ВсеПользователи);
	Запрос.УстановитьПараметр("СогласующиеЛица", СогласующиеЛица);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СогласующиеЛица.Пользователь,
	|	СогласующиеЛица.НастройкаОбработкиВизирования
	|ПОМЕСТИТЬ СогласующиеЛица
	|ИЗ
	|	&СогласующиеЛица КАК СогласующиеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СогласующиеЛица.Пользователь = &ВсеПользователи
	|			ТОГДА СпрПользователи.Ссылка
	|		КОГДА ТИПЗНАЧЕНИЯ(СогласующиеЛица.Пользователь) = ТИП(Справочник.ГруппыПользователей)
	|			ТОГДА ПользователиГруппы.Пользователь
	|		ИНАЧЕ СогласующиеЛица.Пользователь
	|	КОНЕЦ КАК Пользователь,
	|	СогласующиеЛица.НастройкаОбработкиВизирования
	|ИЗ
	|	СогласующиеЛица КАК СогласующиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.%ИмяТабЧасти% КАК ПользователиГруппы
	|		ПО СогласующиеЛица.Пользователь = ПользователиГруппы.Ссылка,
	|	Справочник.Пользователи КАК СпрПользователи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА СогласующиеЛица.Пользователь = &ВсеПользователи
	|			ТОГДА СпрПользователи.Ссылка
	|		КОГДА ТИПЗНАЧЕНИЯ(СогласующиеЛица.Пользователь) = ТИП(Справочник.ГруппыПользователей)
	|			ТОГДА ПользователиГруппы.Пользователь
	|		ИНАЧЕ СогласующиеЛица.Пользователь
	|	КОНЕЦ,
	|	СогласующиеЛица.НастройкаОбработкиВизирования";
	
	ИмяТабЧасти = бит_ОбщегоНазначения.ИмяТабЧастиГруппыПользователей();
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяТабЧасти%", ИмяТабЧасти);	
	ТаблицаПользователей = Запрос.Выполнить().Выгрузить();
	// Для каждого пользователя укажем настройку обработки визирования.
	Для Каждого СтрокаПользователя Из ТаблицаПользователей Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаПользователя.НастройкаОбработкиВизирования) Тогда
			СтрокаПользователя.НастройкаОбработкиВизирования = НастройкаОбработкиВизирования;
		КонецЕсли;
	КонецЦикла;
	
	ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ДокументыДляВизирования;                  
	ПараметрыПолучения = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыЗаполненияТаблицыВизирования();
	ПараметрыПолучения.ВыводитьВТаблицуЗначений	= Истина;
	ПараметрыПолучения.РежимПроверкиОповещений	= Истина;
	ПараметрыПолучения.ЭтоОповещения			= Истина;
	Для каждого ТекущийПользователь Из ТаблицаПользователей Цикл
		Если НЕ ЗначениеЗаполнено(ТекущийПользователь.НастройкаОбработкиВизирования)
			ИЛИ НЕ ЗначениеЗаполнено(ТекущийПользователь.Пользователь) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураНастроек = ТекущийПользователь.НастройкаОбработкиВизирования.ХранилищеНастроек.Получить();
		Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
			ПараметрыПолучения.Ответственный			= ТекущийПользователь.Пользователь;
			ПараметрыПолучения.МатрицаДоступа			= Обработки.бит_КонсольОперативногоВизирования.МатрицаДоступа(
															ТекущийПользователь.Пользователь);
			ПараметрыПолучения.НастройкиКомпоновщика	= СтруктураНастроек.НастройкиКомпоновщика;
			ПараметрыПолучения.ВариантОтбораВиз			= СтруктураНастроек.ВариантОтбораВиз; 
			ПараметрыПолучения.Отбор.ТипОбъекта         = СтруктураНастроек.ТипыОбъектовВизирования;
			ПараметрыПолучения.Отбор.Виза				= СтруктураНастроек.ФильтрВизы; 
			АдресВХранилище = ПоместитьВоВременноеХранилище(Новый ТаблицаЗначений, Новый УникальныйИдентификатор); 
			Обработки.бит_КонсольОперативногоВизирования.ЗаполнитьТаблицуВизирования(ПараметрыПолучения, АдресВХранилище);	
			Результат = ПолучитьИзВременногоХранилища(АдресВХранилище);
			ДокументыПользователя = Результат.РезультатТаблицаЗначений;
			
			Для каждого Документ Из ДокументыПользователя Цикл
				ПараметрыСобытия				= бит_ОповещенияСервер.НовыеПараметрыСобытия();
				ПараметрыСобытия.ВидСобытия		= ВидСобытия;
				ПараметрыСобытия.Оповещение		= Оповещение;
				ПараметрыСобытия.Объект			= Документ.ОбъектВизирования;
				ПараметрыСобытия.Пользователь	= ТекущийПользователь.Пользователь;
				ПараметрыСобытия.Виза			= Документ.Виза;
				ПараметрыСобытия.Статус			= Документ.Статус;
				бит_ОповещенияСервер.ЗарегистрироватьСобытиеДляОповещений(ПараметрыСобытия);
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

// Обработчик регламентного задания "бит_СоздатьДокументыПланированияИзДопУсловий".
// Создает документы плаинрования из доп. условий по договору.
// 
// Параметры:
//  СтруктураПараметров - Структура.
//
Процедура СоздатьДокументыПланированияИзДопУсловий(СтруктураПараметров = Неопределено) Экспорт
	
	бит_Казначейство.СоздатьДокументыПланированияИзДопУсловий(СтруктураПараметров);	
	
КонецПроцедуры

// Обработчик регламентного задания "бит_ОбработкаНазначенияЗаместителей".
// Выполняет назначение/удаление назначения заместителей в регистрах бит_ПраваУстановкиВиз и бит_ИсполнителиЗадач.
// 
// Параметры:
//  Нет.
// 
Процедура ОбработкаНазначенияЗаместителей() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_ОбработкаНазначенияЗаместителей);
	
	ИмяСобытия = НСтр("ru='Начало выполнения обработки назначения заместителей.';
					  |en='Job Appointment of deputies started.'", ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = НСтр("ru='Начало выполнения обработки назначения заместителей.';
						  |en='Job Appointment of deputies started.'"); 
    ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);

	// Завершение замещения.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата",       НачалоДня(ТекущаяДатаСеанса())); // Снимаем заместителей, которые вчера закончились.
	Запрос.УстановитьПараметр("СостояниеНазначен", Перечисления.бит_СостоянияЗаместителей.Назначен);
	Запрос.УстановитьПараметр("СостояниеОжидание", Перечисления.бит_СостоянияЗаместителей.Ожидание);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначенныеЗаместители.Пользователь КАК Пользователь,
	|	НазначенныеЗаместители.Состояние КАК Состояние,
	|	НазначенныеЗаместители.Виза КАК Виза,
	|	НазначенныеЗаместители.ПользовательскоеУсловие КАК ПользовательскоеУсловие,
	|	НазначенныеЗаместители.РольИсполнителя КАК РольИсполнителя,
	|	НазначенныеЗаместители.ОбъектАдресации_1 КАК ОбъектАдресации_1,
	|	НазначенныеЗаместители.ОбъектАдресации_2 КАК ОбъектАдресации_2,
	|	НазначенныеЗаместители.ОбъектАдресации_3 КАК ОбъектАдресации_3,
	|	НазначенныеЗаместители.Заместитель КАК Заместитель,
	|	НазначенныеЗаместители.ДатаНачала КАК ДатаНачала,
	|	НазначенныеЗаместители.ДатаОкончания КАК ДатаОкончания,
	|	НазначенныеЗаместители.ПередаватьПраваРЛС КАК ПередаватьПраваРЛС,
	|	0 КАК ВидЗамещения
	|ИЗ
	|	РегистрСведений.бит_НазначенныеЗаместители КАК НазначенныеЗаместители
	|ГДЕ
	|	НазначенныеЗаместители.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	|	И НазначенныеЗаместители.ДатаОкончания < &ТекущаяДата
	|	И (НазначенныеЗаместители.Состояние = &СостояниеНазначен
	|			ИЛИ НазначенныеЗаместители.Состояние = &СостояниеОжидание)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаместителиПоЗадачам.Пользователь,
	|	ЗаместителиПоЗадачам.Состояние,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗаместителиПоЗадачам.Заместитель,
	|	ЗаместителиПоЗадачам.ДатаНачала,
	|	ЗаместителиПоЗадачам.ДатаОкончания,
	|	NULL,
	|	1
	|ИЗ
	|	РегистрСведений.бит_ЗаместителиПоЗадачам КАК ЗаместителиПоЗадачам
	|ГДЕ
	|	ЗаместителиПоЗадачам.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ЗаместителиПоЗадачам.ДатаОкончания < &ТекущаяДата
	|	И (ЗаместителиПоЗадачам.Состояние = &СостояниеНазначен
	|			ИЛИ ЗаместителиПоЗадачам.Состояние = &СостояниеОжидание)";
				   
    Результат = Запрос.Выполнить();				   
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВидЗамещения = 0 Тогда
			МенеджерЗаписи = РегистрыСведений.бит_НазначенныеЗаместители.СоздатьМенеджерЗаписи();
		Иначе
			МенеджерЗаписи = РегистрыСведений.бит_ЗаместителиПоЗадачам.СоздатьМенеджерЗаписи();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Состояние = Перечисления.бит_СостоянияЗаместителей.ЗамещениеЗавершено;
		
		Попытка		
			МенеджерЗаписи.Записать();		
		Исключение
			ИмяСобытия = НСтр("ru='Ошибка обработки назначения заместителей.';
							  |en='Error in job Appointment of deputies'", ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстСообщения = НСтр("ru='Не удалось завершить замещение пользователя ""%1"" пользователем ""%2"". Описание ошибки: %3.';
								  |en='Unable to complete replacement of the user ""%1"" user ""%2"". description of the error: %3.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Пользователь, Выборка.Заместитель, 
									   ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));			
	        ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		КонецПопытки;
				
	КонецЦикла; // Завершение замещения.
	
	// Назначение заместителей.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата",       ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СостояниеОжидание", Перечисления.бит_СостоянияЗаместителей.Ожидание);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначенныеЗаместители.Состояние КАК Состояние,
	|	НазначенныеЗаместители.Виза КАК Виза,
	|	НазначенныеЗаместители.ПользовательскоеУсловие КАК ПользовательскоеУсловие,
	|	НазначенныеЗаместители.РольИсполнителя КАК РольИсполнителя,
	|	НазначенныеЗаместители.ОбъектАдресации_1 КАК ОбъектАдресации_1,
	|	НазначенныеЗаместители.ОбъектАдресации_2 КАК ОбъектАдресации_2,
	|	НазначенныеЗаместители.ОбъектАдресации_3 КАК ОбъектАдресации_3,
	|	НазначенныеЗаместители.Заместитель КАК Заместитель,
	|	НазначенныеЗаместители.ДатаНачала КАК ДатаНачала,
	|	НазначенныеЗаместители.ДатаОкончания КАК ДатаОкончания,
	|	НазначенныеЗаместители.Пользователь КАК Пользователь,
	|	НазначенныеЗаместители.ПередаватьПраваРЛС КАК ПередаватьПраваРЛС,
	|	0 КАК ВидЗамещения
	|ИЗ
	|	РегистрСведений.бит_НазначенныеЗаместители КАК НазначенныеЗаместители
	|ГДЕ
	|	НазначенныеЗаместители.Состояние = &СостояниеОжидание
	|	И НазначенныеЗаместители.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	|	И НазначенныеЗаместители.ДатаНачала <= &ТекущаяДата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаместителиПоЗадачам.Состояние,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЗаместителиПоЗадачам.Заместитель,
	|	ЗаместителиПоЗадачам.ДатаНачала,
	|	ЗаместителиПоЗадачам.ДатаОкончания,
	|	ЗаместителиПоЗадачам.Пользователь,
	|	NULL,
	|	1
	|ИЗ
	|	РегистрСведений.бит_ЗаместителиПоЗадачам КАК ЗаместителиПоЗадачам
	|ГДЕ
	|	ЗаместителиПоЗадачам.Состояние = &СостояниеОжидание
	|	И ЗаместителиПоЗадачам.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ЗаместителиПоЗадачам.ДатаНачала <= &ТекущаяДата";
				   
    Результат = Запрос.Выполнить();				   
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл

		Если Выборка.ВидЗамещения = 0 Тогда
			МенеджерЗаписи = РегистрыСведений.бит_НазначенныеЗаместители.СоздатьМенеджерЗаписи();
		Иначе
			МенеджерЗаписи = РегистрыСведений.бит_ЗаместителиПоЗадачам.СоздатьМенеджерЗаписи();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Прочитать();		
		МенеджерЗаписи.Состояние = Перечисления.бит_СостоянияЗаместителей.Назначен;
		
		Попытка		
			МенеджерЗаписи.Записать();		
		Исключение
			ИмяСобытия = НСтр("ru='Ошибка обработки назначения заместителей.';
							  |en='Error in job Appointment of deputies'", ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстСообщения = НСтр("ru='Не удалось назначить заместителя ""%1"" пользователю ""%2"". Описание ошибки: %3.';
								  |en='Failed to appoint a deputy to ""%1"" user ""%2"". Description of the error: %3.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.Заместитель, Выборка.Пользователь, 
									   ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));			
	        ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);			
		КонецПопытки;
							 		
	КонецЦикла; // Завершение замещения.
	
	
	ИмяСобытия = НСтр("ru='Завершено выполнение обработки назначения заместителей.';
					  |en='Job Appointment of deputies completed.'", ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстСообщения = НСтр("ru='Завершено выполнение обработки назначения заместителей.';
						  |en='Job Appointment of deputies completed.'"); 
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
	
КонецПроцедуры

// Обработчик регламентного задания "бит_УстановкаРешенийПоПросроченнымВизам".
// Устанавливает решения по визам, по которым прошли сроки установки решения.
// 
// Параметры:
//  СтруктураПараметров - Структура.
//
Процедура УстановкаРешенийПоПросроченнымВизам(СтруктураПараметров) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_УстановкаРешенийПоПросроченнымВизам);
	
	Отбор = Новый Структура();
	Отбор.Вставить("Метаданные", "бит_УстановкаРешенийПоПросроченнымВизам");
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);

	Если Задания.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ЗаданиеУстановкиРешений = Задания[0]; 
	
	Если Не ЗначениеЗаполнено(ЗаданиеУстановкиРешений.ИмяПользователя) Тогда
		ИмяСобытия = НСтр("ru='Ошибка выполнения регламентного задания.';
						  |en='Error performing routine tasks.'",
						  ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстСообщения = НСтр("ru='Не заполнен пользователь в настройках регламентного задания.';
							  |en='Do not fill the user in the settings of scheduled jobs.'");		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		ВызватьИсключение ТекстСообщения;		
	КонецЕсли;
	
	// Проверим корректность переданых параметров.
	Если НЕ ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
		
	Если СтруктураПараметров.Свойство("Решение") Тогда
		
		Если ЗначениеЗаполнено(СтруктураПараметров.Решение) Тогда
			РешениеВизирования = СтруктураПараметров.Решение;			
		Иначе
			ИмяСобытия = НСтр("ru='Ошибка выполнения регламентного задания.';en='Error performing routine tasks.'",
							  ОбщегоНазначения.КодОсновногоЯзыка());
			ТекстСообщения = НСтр("ru='Не заполнено решения визирования в настройках регламентного задания.';
								  |en='Not filled solutions in sight settings routine tasks.'");		
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;

	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ЗаданиеУстановкиРешений.ИмяПользователя);
	ПользовательВизирования = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_УстановленныеВизы.Объект,
	|	бит_УстановленныеВизы.Виза,
	|	бит_УстановленныеВизы.ИД,
	|	бит_УстановленныеВизы.Пользователь,
	|	бит_УстановленныеВизы.ФизическоеЛицо,
	|	бит_УстановленныеВизы.ДобавленаВручную,
	|	бит_УстановленныеВизы.ДатаУстановки,
	|	бит_УстановленныеВизы.КодСортировки,
	|	бит_УстановленныеВизы.Должность,
	|	бит_УстановленныеВизы.Комментарий,
	|	бит_УстановленныеВизы.Статус,
	|	бит_УстановленныеВизы.Решение,
	|	бит_УстановленныеВизы.Маршрут,
	|	бит_УстановленныеВизы.Алгоритм,
	|	бит_УстановленныеВизы.ТочкаАлгоритма,
	|	бит_УстановленныеВизы.ДатаКрайняя,
	|	бит_УстановленныеВизы.ВремяНаУстановку,
	|	бит_УстановленныеВизы.ПодписанЭП,
	|	бит_УстановленныеВизы.ЭПДействительна
	|ИЗ
	|	РегистрСведений.бит_УстановленныеВизы КАК бит_УстановленныеВизы
	|ГДЕ
	|	бит_УстановленныеВизы.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И бит_УстановленныеВизы.ДатаКрайняя < &ТекущаяДата
	|	И бит_УстановленныеВизы.ДатаКрайняя > ДАТАВРЕМЯ(1, 1, 1)
	|	И бит_УстановленныеВизы.Решение = ЗНАЧЕНИЕ(Справочник.бит_ВидыРешенийСогласования.ПустаяСсылка)";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	
	ИмяОбъектаПолное = "";
	Если СтруктураПараметров.Свойство("ОбъектСистемы") И ЗначениеЗаполнено(СтруктураПараметров.ОбъектСистемы) Тогда
		ИмяОбъектаПолное = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураПараметров.ОбъектСистемы, "ИмяОбъектаПолное");
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("бит_УстановленныеВизы.Объект Ссылка "+ ИмяОбъектаПолное);
	КонецЕсли;
	Если СтруктураПараметров.Свойство("Организация") И ЗначениеЗаполнено(СтруктураПараметров.Организация) Тогда
		Если ПустаяСтрока(ИмяОбъектаПолное) Тогда
			МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяОбъектаПолное);
			Если бит_РаботаСМетаданными.ЕстьРеквизит("Организация",МетаданныеОбъекта) Тогда
				СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("бит_УстановленныеВизы.Объект.Организация = &Организация");
				Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
			КонецЕсли;
		Иначе
			СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("бит_УстановленныеВизы.Объект.Организация = &Организация");
			Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
		КонецЕсли;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("Статус") И ЗначениеЗаполнено(СтруктураПараметров.Статус) Тогда
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("бит_УстановленныеВизы.Статус = &Статус");
		Запрос.УстановитьПараметр("Статус", СтруктураПараметров.Статус);
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Запись = РегистрыСведений.бит_УстановленныеВизы.СоздатьМенеджерЗаписи(); 

	Пока Выборка.Следующий() Цикл 
		
        Запись.Объект = Выборка.Объект; 
        Запись.Виза   = Выборка.Виза; 
        Запись.ИД     = Выборка.ИД;
        
        Запись.Прочитать(); 
		Если Запись.Выбран() Тогда 
			Запись.ДатаУстановки = ТекущаяДатаСеанса();
			Запись.Пользователь  = ПользовательВизирования;
            Запись.Решение       = РешениеВизирования;
			Запись.Комментарий   = НСтр("ru='Решение установлено с помощью регламентного задания ""Установить решения по просроченным визам"".';
										|en='The solution found by a routine job ""Set decisions on an expired visa.""'");
			Если Запись.ПроверитьЗаполнение() Тогда
				Запись.Записать(); 
			КонецЕсли;
		КонецЕсли; 
		
	КонецЦикла; 
			
КонецПроцедуры

// Обработчик регламентного задания "бит_АвтоСогласование".
// Автоматическая установка решений по визам.
// 
// Параметры:
//  Нет.
//
Процедура АвтоСогласование() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_АвтоСогласование);
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьАвтоСогласование") Тогда
		ВызватьИсключение НСтр("ru='Регламентное задание недоступно по функциональным опциям.';
		|en='Scheduled task is not available for functional options.'");
	КонецЕсли;
	
	Отбор = Новый Структура();
	Отбор.Вставить("Метаданные", "бит_АвтоСогласование");
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);

	Если Задания.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ЗаданиеУстановкиРешений = Задания[0]; 
	
	Если НЕ ЗначениеЗаполнено(ЗаданиеУстановкиРешений.ИмяПользователя) Тогда
		ИмяСобытия = НСтр("ru='Ошибка выполнения регламентного задания.';
						  |en='Error performing routine tasks.'",
						  ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстСообщения = НСтр("ru='Не заполнен пользователь в настройках регламентного задания.';
							  |en='Do not fill the user in the settings of scheduled jobs.'");		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		ВызватьИсключение ТекстСообщения;		
	КонецЕсли;
	
	ПользовательИБ          = ПользователиИнформационнойБазы.НайтиПоИмени(ЗаданиеУстановкиРешений.ИмяПользователя);
	ПользовательВизирования = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",
								ПользовательИБ.УникальныйИдентификатор);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УстановленныеВизы.Объект КАК Объект,
	|	УстановленныеВизы.Виза КАК Виза,
	|	УстановленныеВизы.ИД КАК ИД,
	|	УстановленныеВизы.Алгоритм КАК Алгоритм,
	|	УстановленныеВизы.ДатаКрайняя КАК ДатаКрайняя,
	|	УстановленныеВизы.АктивнаяВиза КАК АктивнаяВиза
	|ПОМЕСТИТЬ АктивныеВизы
	|ИЗ
	|	РегистрСведений.бит_УстановленныеВизы КАК УстановленныеВизы
	|ГДЕ
	|	УстановленныеВизы.АктивнаяВиза
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Виза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктивныеВизы.Объект КАК Объект,
	|	АктивныеВизы.Виза КАК Виза,
	|	АктивныеВизы.ИД КАК ИД,
	|	НастройкиАвтоСогласования.ПользовательскоеУсловие КАК ПользовательскоеУсловие,
	|	НастройкиАвтоСогласования.Решение КАК Решение,
	|	НастройкиАвтоСогласования.Комментарий КАК Комментарий
	|ИЗ
	|	АктивныеВизы КАК АктивныеВизы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкиАвтоСогласования КАК НастройкиАвтоСогласования
	|		ПО (НастройкиАвтоСогласования.Виза = ЗНАЧЕНИЕ(Справочник.бит_Визы.ПустаяСсылка)
	|				ИЛИ АктивныеВизы.Виза = НастройкиАвтоСогласования.Виза)
	|			И (НастройкиАвтоСогласования.Алгоритм = ЗНАЧЕНИЕ(Справочник.бит_АлгоритмыПроцессов.ПустаяСсылка)
	|				ИЛИ АктивныеВизы.Алгоритм = НастройкиАвтоСогласования.Алгоритм)
	|			И (НастройкиАвтоСогласования.Просрочка = 0
	|				ИЛИ АктивныеВизы.ДатаКрайняя > ДАТАВРЕМЯ(1, 1, 1)
	|					И ДОБАВИТЬКДАТЕ(АктивныеВизы.ДатаКрайняя, МИНУТА, НастройкиАвтоСогласования.Просрочка) < &ТекущаяДата)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиАвтоСогласования.ПользовательскоеУсловие = ЗНАЧЕНИЕ(Справочник.бит_ПользовательскиеУсловия.ПустаяСсылка) УБЫВ
	|ИТОГИ ПО
	|	Объект,
	|	Виза,
	|	ИД";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	ВыборкаОбъектов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбъектов.Следующий() Цикл
		ВыборкаВиз = ВыборкаОбъектов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВиз.Следующий() Цикл
			ВыборкаИдентификаторов = ВыборкаВиз.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаИдентификаторов.Следующий() Цикл
				ДетальныеЗаписи = ВыборкаИдентификаторов.Выбрать();
				Пока ДетальныеЗаписи.Следующий() Цикл
					Если НЕ ЗначениеЗаполнено(ДетальныеЗаписи.ПользовательскоеУсловие) Тогда
						УстановитьРешениеАвтоСогласования(ДетальныеЗаписи, ПользовательВизирования);
						Прервать;
					Иначе
						ПараметрыУсловия = Новый Структура;
						ПараметрыУсловия.Вставить("ТекущийОбъект", ДетальныеЗаписи.Объект);
						Если бит_УправлениеПроцессами.ПроверитьПользовательскоеУсловие(ДетальныеЗаписи.ПользовательскоеУсловие,
																							ПараметрыУсловия) Тогда
							УстановитьРешениеАвтоСогласования(ДетальныеЗаписи, ПользовательВизирования);
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла; 
			
КонецПроцедуры

// Обработчик регламентного задания "бит_УстановкаКонтрольныхЗначений".
// 
// Параметры:
//  ПараметрыЗадания - Структура.
//
Процедура УстановкаКонтрольныхЗначений(ПараметрыЗадания) Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_УстановкаКонтрольныхЗначений);
	Если ТипЗнч(ПараметрыЗадания) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли; 
	
	Документы.бит_УстановкаКонтрольныхЗначений.ФоновоеПроведение(ПараметрыЗадания);
	
КонецПроцедуры

// Обработчик регламентного задания "бит_УдалениеИсторииТелеграм".
// Выполняет очистку истории в регистрах бит_ПараметрыСообщенийТелеграм и бит_РеестрОбменаСТелеграм.
// 
// Параметры:
//  Нет.
//
Процедура УдалениеИсторииТелеграм() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.бит_УдалениеИсторииТелеграм);
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ПолучатьИнформациюОтБотаТелеграм") Тогда
		ВызватьИсключение НСтр("ru='Регламентное задание недоступно по функциональным опциям.';
		|en='Scheduled task is not available for functional options.'");
	КонецЕсли;
	
	РегистрыСведений.бит_ПараметрыСообщенийТелеграм.УдалитьИсториюЗаписей();
	РегистрыСведений.бит_РеестрОбменаСТелеграм.УдалитьИсториюЗаписей();
	
КонецПроцедуры

// Обработчик регламентного задания "бит_СтартПериодическихПроцессовБФ".
// Стартует произвольные процессы по рассписанию.
// 
// Параметры:
//  ПараметрыЗадания - Структура.
//
Процедура СтартоватьПроцесс(ПараметрыЗадания) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.бит_СтартПериодическихПроцессовБФ);
	
	Если ТипЗнч(ПараметрыЗадания) = Тип("Массив") Тогда
		МассивАлгоритмов = ПараметрыЗадания;
	ИначеЕсли ТипЗнч(ПараметрыЗадания) = Тип("СправочникСсылка.бит_АлгоритмыПроцессов") Тогда
		МассивАлгоритмов = Новый Массив;
		МассивАлгоритмов.Добавить(ПараметрыЗадания);
	Иначе
		Возврат;
	КонецЕсли; 
	
	Для каждого АлгоритмПроцесса Из МассивАлгоритмов Цикл
		НачатьТранзакцию();
		Попытка
			НовыйПроцесс = БизнесПроцессы.бит_Процесс.СоздатьБизнесПроцесс();
			НовыйПроцесс.Дата = ТекущаяДатаСеанса();
			НовыйПроцесс.Заполнить(АлгоритмПроцесса);
			НовыйПроцесс.Записать();
			НовыйПроцесс.Старт();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Обработчик регламентного задания "бит_СозданиеКлючейДоступаЦФОСтатьяОборотов".
// Создание ключей доступа для механизма RLS.
// 
// Параметры:
//  Нет.
//
Процедура СозданиеКлючейДоступаЦФОСтатьяОборотов() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.бит_СозданиеКлючейДоступаЦФОСтатьяОборотов);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяСтатья", Справочники.бит_СтатьиОборотов.ПустаяСсылка()); 
	Запрос.УстановитьПараметр("ПустоеЦФО", Справочники.Подразделения.ПустаяСсылка());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подразделения.Ссылка КАК ЦФО,
		|	&ПустаяСтатья КАК СтатьяОборотов
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_КлючиДоступаЦФОСтатьиОборотов КАК КлючиДоступа
		|		ПО (КлючиДоступа.ЦФО = Подразделения.Ссылка)
		|ГДЕ
		|	КлючиДоступа.Ссылка ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ПустоеЦФО,
		|	СтатьиОборотов.Ссылка
		|ИЗ
		|	Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_КлючиДоступаЦФОСтатьиОборотов КАК КлючиДоступа
		|		ПО (КлючиДоступа.СтатьяОборотов = СтатьиОборотов.Ссылка)
		|ГДЕ
		|	КлючиДоступа.Ссылка ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(Выборка.ЦФО, Выборка.СтатьяОборотов);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область АвтоСогласование

Процедура УстановитьРешениеАвтоСогласования(ПараметрыУстановкиРешения, Пользователь)
	
	КомментарийРешения = НСтр("ru='Автосогласование';en='Auto-negotiation'");
	
	Если НЕ ПустаяСтрока(ПараметрыУстановкиРешения.Комментарий) Тогда
		КомментарийРешения = КомментарийРешения + ": " + ПараметрыУстановкиРешения.Комментарий;
	КонецЕсли;
	
	ПараметрыРешения = Обработки.бит_КонсольОперативногоВизирования.НовыеПараметрыПринятияРешения();
	ПараметрыРешения.ОбъектВизирования    = ПараметрыУстановкиРешения.Объект;
	ПараметрыРешения.ИДВизы               = ПараметрыУстановкиРешения.ИД;
	ПараметрыРешения.ТекущийПользователь  = Пользователь;
	ПараметрыРешения.Решение              = ПараметрыУстановкиРешения.Решение;
	ПараметрыРешения.Комментарий          = КомментарийРешения;
	ПараметрыРешения.ДатаУстановкиРешения = ТекущаяДатаСеанса();
	
	Обработки.бит_КонсольОперативногоВизирования.УстановитьРешениеПоВизе(ПараметрыРешения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
